openfoam/vortexTube-unsteady/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Ubar            [0 1 -1 0 0 0 0] (0 0 -1);

viscosityModel  constant;

//nu              [0 2 -1 0 0 0 0] 1e-05;
//nu              [0 2 -1 0 0 0 0] 2.5e-2; //steady
//nu              [0 2 -1 0 0 0 0] 0.001428571; //Reh=700
//nu              [0 2 -1 0 0 0 0] 0.001666667; //Reh=600
nu              [0 2 -1 0 0 0 0] 1; //Reh=600

// ************************************************************************* //
